# Ruby kaigi 2018

## bancor: Token economy made with Ruby
@kurotaky
gmo pepabo
suzuri people クリエーター支援

bancor gem
Blockchain 分散型台帳
Proof of work

pros
非中央集権の台帳として機能する
改竄が実質不可能

cons
スケールしない
UX的に問題がある

Blockchain application
ヘルスケア
ID管理
契約

エストニア
いろいろなサービスが電子化されている。
BlockChaneも使われている。

SmartContract
Ethereum プラットフォーム

TokenEconomy
ICO Initial Coin Offering
企業が資金を調達するIPOと似ている
ALis 透明性の高い開発が行われている

TokenEconomy 地域通貨コミュニティで使えるチケットをEthriumと交換する

BlockChain上で資金調達でマイナーなコインは売りたいときに売れないし買いたいときに買えない

上の問題を解決する Bancor Protocol

Bancor Protocol を実装したgem Bancor
RailsのWebアプリで使える

小数点とかちゃんと考慮していないので考慮しないといけない

Q&A

Q:複雑な数式で価格が決定されると買う側の納得感が大事になると思うが
A:金額で売ったり買ったりするとどうなんだろうというのはわかりづらい。グラフとか取引履歴でフィードバックしないと分かりづらい。ユーザ体験として見せ方はしっかり作らないといけない。

Q:価格の決定は文化として決定していければ大丈夫だと思う。使ってみた肌感はどうか？
A:あんまりこれ使って取引しているという事例はないので、やっぱりちゃんとグラフとか使って売ったり買ったりする行動をしていかないといけない。まだ発展途上なのでWebアプリとして使える実装を行っていかないといけない。

Q:流動性がありすぎて価値の保存が不安定になっている。プロトコルを使用したら取引上のような未来になるのか
A:マイナーなトークンを活用できるようにするためのものになるのではないか

Q:日本でそういうことをやろうとすると規制に引っかかりそう。普及と実績をどう確保していくか？
A:法規制や世の中の流れで作ったものを世に出すのが難しくなっている。うまくつきあっていくしかない。

Q:マネーゲームになりやすいと思うがbancor protocolで何か対策がされているか
A:準備率を変えたときにどうなるかのグラフは書かれている。対策できているかはよくわからない。
